; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph2 - mode
	image0 - mode
	image3 - mode
	thermograph1 - mode
	image4 - mode
	thermograph5 - mode
	Star5 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star3 - direction
	Star6 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph5)
	(supports instrument3 image4)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 image4)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star3)
	(supports instrument5 image3)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star3)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Planet7 image3)
	(have_image Planet7 image0)
	(have_image Planet8 thermograph1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon9 spectrograph2)
	(have_image Planet10 thermograph1)
	(have_image Planet10 image0)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon11 image3)
	(have_image Planet12 thermograph5)
	(have_image Planet12 image4)
))

)

; plan
1. (turn_to satellite3 star3 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 star3)
   goals met: 0 of 13
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 13
3. (calibrate satellite3 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 13
4. (turn_to satellite3 planet10 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet10)
   goals met: 0 of 13
5. (take_image satellite3 planet10 instrument5 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 1 of 13
6. (take_image satellite3 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 13
7. (turn_to satellite3 phenomenon11 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon11)
   goals met: 2 of 13
8. (turn_to satellite2 groundstation4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 13
9. (turn_to satellite1 groundstation0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 13
10. (take_image satellite3 phenomenon11 instrument5 image3)
   added: (have_image phenomenon11 image3)
   goals met: 3 of 13
11. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 13
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 13
13. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 13
14. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 13
15. (turn_to satellite1 phenomenon9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 13
16. (take_image satellite1 phenomenon9 instrument1 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 4 of 13
17. (turn_to satellite1 star5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star5)
   goals met: 5 of 13
18. (turn_to satellite2 phenomenon11 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon11)
   goals met: 5 of 13
19. (take_image satellite2 phenomenon11 instrument3 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 6 of 13
20. (turn_to satellite2 planet12 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet12)
   goals met: 6 of 13
21. (take_image satellite2 planet12 instrument3 image4)
   added: (have_image planet12 image4)
   goals met: 7 of 13
22. (take_image satellite2 planet12 instrument3 thermograph5)
   added: (have_image planet12 thermograph5)
   goals met: 8 of 13
23. (turn_to satellite3 phenomenon9 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon9)
   goals met: 8 of 13
24. (take_image satellite3 phenomenon9 instrument5 image3)
   added: (have_image phenomenon9 image3)
   goals met: 9 of 13
25. (turn_to satellite3 planet7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet7)
   goals met: 9 of 13
26. (take_image satellite3 planet7 instrument5 image0)
   added: (have_image planet7 image0)
   goals met: 10 of 13
27. (take_image satellite3 planet7 instrument5 image3)
   added: (have_image planet7 image3)
   goals met: 11 of 13
28. (turn_to satellite3 planet8 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet8)
   goals met: 11 of 13
29. (take_image satellite3 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 12 of 13
30. (take_image satellite3 planet8 instrument5 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 13 of 13
